"""
PostgresqlSQLAlchemy

- Почему изучаем SQL.
- Что такое БД.
- Основные принципы реляционых БД.
- Что такое SQL?

"""

"""
Ответы:

-Устройство на ваканции
- Аналитик
- Тестировщик
- Разработчик SQL
- Разработчик lava/python/ruby/...
- Почти все бызы даных используют язык запросов
-Возможность хранить большие обьемы информации
-Высокая скорость работы 
-Несколько пользователей могуть работать одновременно с БД
-Согласованость и целосность данных
-Встроенный механизм транзакции

Транзакционные базы даных!!

ACID:
Atomicity   - Атомарность
Consistensy - Согласованность           - 
Isolation  - Изолированость
Durability - Прочность


"""